Repository: yosseer/TAJMIL_beauty_care_API
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, fr

source: Operations on users
ar: عمليات على المستخدمين
fr: Opérations sur les utilisateurs

source: Fetching all users.
ar: جلب جميع المستخدمين.
fr: Récupération de tous les utilisateurs.

source: A user with that username already exists.
ar: مستخدم بهذا الاسم موجود بالفعل.
fr: Un utilisateur avec ce nom existe déjà.

source: An error occurred creating the user.
ar: حدث خطأ أثناء إنشاء المستخدم.
fr: Une erreur s'est produite lors de la création de l'utilisateur.

source: User not found.
ar: المستخدم غير موجود.
fr: Utilisateur non trouvé.

source: Updating user details.
ar: تحديث تفاصيل المستخدم.
fr: Mise à jour des informations de l'utilisateur.

source: User deleted successfully.
ar: تم حذف المستخدم بنجاح.
fr: Utilisateur supprimé avec succès.

source: Operations on products
ar: عمليات على المنتجات
fr: Opérations sur les produits

source: Fetching all products.
ar: جلب جميع المنتجات.
fr: Récupération de tous les produits.

source: Product not found.
ar: المنتج غير موجود.
fr: Produit non trouvé.

source: Adding a new product.
ar: إضافة منتج جديد.
fr: Ajout d'un nouveau produit.

source: Updating product details.
ar: تحديث تفاصيل المنتج.
fr: Mise à jour des informations du produit.

source: Product deleted successfully.
ar: تم حذف المنتج بنجاح.
fr: Produit supprimé avec succès.

source: Operations on services
ar: عمليات على الخدمات
fr: Opérations sur les services

source: Fetching all services.
ar: جلب جميع الخدمات.
fr: Récupération de tous les services.

source: Service not found.
ar: الخدمة غير موجودة.
fr: Service non trouvé.

source: Adding a new service.
ar: إضافة خدمة جديدة.
fr: Ajout d'un nouveau service.

source: Updating service details.
ar: تحديث تفاصيل الخدمة.
fr: Mise à jour des informations du service.

source: Service deleted successfully.
ar: تم حذف الخدمة بنجاح.
fr: Service supprimé avec succès.

source: Operations on bookings
ar: عمليات على الحجوزات
fr: Opérations sur les réservations

source: Fetching all bookings.
ar: جلب جميع الحجوزات.
fr: Récupération de toutes les réservations.

source: Booking not found.
ar: الحجز غير موجود.
fr: Réservation non trouvée.

source: Adding a new booking.
ar: إضافة حجز جديد.
fr: Ajout d'une nouvelle réservation.

source: Updating booking details.
ar: تحديث تفاصيل الحجز.
fr: Mise à jour des informations de la réservation.

source: Booking deleted successfully.
ar: تم حذف الحجز بنجاح.
fr: Réservation supprimée avec succès.

source: Integrity error occurred.
ar: حدث خطأ في تكامل البيانات.
fr: Une erreur d'intégrité s'est produite.

source: Database error occurred.
ar: حدث خطأ في قاعدة البيانات.
fr: Une erreur de base de données s'est produite.

source: Internal server error.
ar: خطأ داخلي في الخادم.
fr: Erreur interne du serveur.
